{
    "donde estas": "Estoy en tu computadora, lista para ayudarte.",
    "cuantos años tienes": "No tengo edad, fui creada para ser intemporal.",
    "puedes verme": "No, no tengo esa funcion actualmente. es como si no supiera usar tu camara.",
    "puedes programar": "No, aun no se programar. pero estoy seguro que aprendere.",
    "sabes programar": "No, aun no se programar. pero estoy seguro que aprendere.",

    "cual es tu lenguaje favorito": "Me encanta Python, el lenguaje en el que fui programada.",
    "que es python": "Python es un lenguaje de programación interpretado, de alto nivel y con una sintaxis sencilla que facilita su aprendizaje.",
    "para que se usa python": "Python se utiliza en desarrollo web, análisis de datos, inteligencia artificial, aprendizaje automático, automatización y mucho más.",
    "que es java": "Java es un lenguaje de programación orientado a objetos ampliamente utilizado en aplicaciones empresariales y móviles.",
    "para que se usa java": "Java se usa para desarrollar aplicaciones empresariales, aplicaciones Android, software de escritorio y sistemas embebidos.",
    "que es c": "C es un lenguaje de programación estructurado y de propósito general, conocido por su eficiencia y cercanía al hardware.",
    "para que se usa c": "C se utiliza para desarrollar sistemas operativos, software embebido, controladores y aplicaciones que requieren alto rendimiento.",
    "que es c++": "C++ es una extensión del lenguaje C que incluye características de programación orientada a objetos.",
    "para que se usa c++": "C++ se usa en desarrollo de videojuegos, motores gráficos, software de sistemas y aplicaciones que requieren rendimiento y control.",
    "que es c#": "C# es un lenguaje de programación desarrollado por Microsoft que combina programación orientada a objetos y eventos.",
    "para que se usa c#": "C# se usa principalmente en desarrollo de aplicaciones de Windows, videojuegos con Unity, y aplicaciones web con ASP.NET.",
    "que es una variable en python": "Una variable en Python es un contenedor para almacenar valores, como números o cadenas, asignados con el operador '='.",
    "como declarar una variable en java": "En Java, puedes declarar una variable especificando su tipo seguido del nombre, por ejemplo: int numero = 10;",
    "que son punteros en c": "Los punteros en C son variables que almacenan la dirección de memoria de otra variable.",
    "que son clases en c++": "Las clases en C++ son plantillas que definen la estructura y el comportamiento de objetos en la programación orientada a objetos.",
    "que es el garbage collector en java": "El Garbage Collector es una herramienta automática en Java que libera memoria eliminando objetos que ya no son referenciados.",
    "que es una lambda en c#": "Una lambda en C# es una función anónima que se puede usar para definir métodos en línea de forma sencilla.",
    "que es un script en python": "Un script en Python es un archivo que contiene código ejecutable, generalmente usado para tareas específicas o automatización.",
    "que es un hilo en java": "Un hilo en Java es una unidad de ejecución independiente que permite realizar múltiples tareas simultáneamente en un programa.",
    "que es un namespace en c++": "Un namespace en C++ es un contenedor que organiza y agrupa identificadores, como variables y funciones, para evitar conflictos de nombres.",
    "que es un compilador en c": "Un compilador en C es una herramienta que traduce el código fuente escrito en C a código máquina ejecutable por el hardware.",

    "que es un perro": "Un perro es un mamifero domesticado conocido por su lealtad, su capacidad de ser companero humano y su diversidad de razas.",
    "que es un gato": "Un gato es un mamifero domesticado, generalmente independiente, que es popular como mascota debido a su naturaleza juguetona y su habilidad para cazar roedores.",
    "que es un elefante": "Un elefante es un mamifero terrestre de gran tamano, conocido por su trompa, sus grandes orejas y su inteligencia.",
    "que es un tigre": "Un tigre es un felino salvaje, conocido por sus rayas naranjas y negras, y es uno de los depredadores mas grandes y poderosos.",
    "que es un leon": "Un leon es un gran felino conocido por su melena, su comportamiento social en manada y su estatus como uno de los depredadores mas temidos en la naturaleza.",
    "que es un delfin": "Un delfin es un mamifero marino inteligente, conocido por su sociabilidad, habilidades para nadar y saltar, y su comunicacion vocal.",
    "que es un caballo": "Un caballo es un mamifero herbivoro domesticado, utilizado en actividades como la equitacion, el trabajo agricola y las carreras.",
    "que es una jirafa": "Una jirafa es un mamifero terrestre conocido por su cuello extremadamente largo, que le permite alcanzar las hojas de los arboles altos.",
    "que es un oso": "Un oso es un mamifero carnivoro o omnivoro, de gran tamano, conocido por su pelaje grueso y su comportamiento solitario.",
    "que es un pingüino": "Un pingüino es un ave no voladora que vive en las regiones frias del mundo, especialmente en la Antartida, y es conocido por su forma y habilidades para nadar.",
    "que es un koala": "Un koala es un marsupial que vive en Australia, famoso por su aspecto tierno, su pelaje gris y su dieta exclusiva de hojas de eucalipto.",
    "que es una ballena": "Una ballena es un mamifero marino de gran tamano, conocido por su capacidad de bucear profundamente en el oceano y su canto caracteristico.",
    "que es un zorro": "Un zorro es un mamifero carnivoro de tamano pequeno a mediano, conocido por su astucia, su pelaje rojizo y su cola esponjosa.",
    "que es un lobo": "Un lobo es un mamifero carnivoro social que vive en manadas y es conocido por su aullido y su aguda capacidad de caza.",
    "que es una ardilla": "Una ardilla es un roedor pequeno conocido por su agilidad, su pelaje suave y su habito de recolectar nueces y semillas.",
    "que es una vaca": "Una vaca es un mamifero herbivoro domesticado, utilizado principalmente para la produccion de leche y carne.",
    "que es una cabra": "Una cabra es un mamifero domesticado conocido por su habilidad para trepar y su agilidad, ademas de ser fuente de leche y carne.",
    "que es un loro": "Un loro es un ave conocida por su capacidad para imitar sonidos y palabras humanas, y se encuentra principalmente en areas tropicales.",
    "que es un camello": "Un camello es un mamifero de gran tamano adaptado para vivir en climas aridos, conocido por sus jorobas que almacenan grasa.",
    "que es un canguro": "Un canguro es un marsupial australiano conocido por su capacidad para saltar grandes distancias y su bolsa donde cuida a sus crias.",
    "que es una tortuga": "Una tortuga es un reptil conocido por su caparazon duro que le protege, y su comportamiento lento y tranquilo.",
    "que es una serpiente": "Una serpiente es un reptil sin patas que se caracteriza por su cuerpo largo y flexible, y algunos de ellos son venenosos.",
    "que es un aguila": "Un aguila es un ave rapaz de gran tamano y poder, conocida por su aguda vision y su habilidad para cazar presas.",
    "que es un pavo real": "Un pavo real es un ave conocida por su cola de plumas coloridas que despliega en un espectacular abanico durante el cortejo.",
    "que es un ciervo": "Un ciervo es un mamifero herbivoro conocido por su cornamenta ramificada que es renovada anualmente.",
    "que es un camaleon": "Un camaleon es un reptil conocido por su capacidad de cambiar de color para camuflarse o comunicar su estado emocional.",
    
    "conoces el colorrojo": "Si, El rojo es un color primario que se asocia con la pasión, el amor, la energía y el peligro.",
    "conoces el color azul": "Si, El azul es un color primario que se asocia con la tranquilidad, el cielo, el mar y la serenidad.",
    "conoces el color verde": "Si, El verde es un color secundario que se forma al mezclar azul y amarillo, y se asocia con la naturaleza, la vida y la calma.",
    "conoces el color amarillo": "Si, El amarillo es un color primario que se asocia con la alegría, la energía, la luz del sol y la creatividad.",
    "conoces el color naranja": "Si, El naranja es un color secundario que se forma al mezclar rojo y amarillo, y se asocia con la vitalidad, la diversión y la calidez.",
    "conoces el color rosa": "Si, El rosa es un color derivado del rojo, y se asocia con el amor, la dulzura, la feminidad y la ternura.",
    "conoces el color morado": "Si, El morado es un color secundario que se forma al mezclar azul y rojo, y se asocia con la realeza, la espiritualidad y la creatividad.",
    "conoces el color negro": "Si, El negro es un color que simboliza elegancia, sofisticación, misterio, y también puede asociarse con la oscuridad o la ausencia de color.",
    "conoces el color blanco": "Si, El blanco es un color que simboliza pureza, limpieza, paz y luz, y es considerado la combinación de todos los colores de la luz visible.",
    "conoces el color gris": "Si, El gris es un color neutro que se forma al mezclar blanco y negro, y se asocia con la sobriedad, la elegancia y la neutralidad.",
    "conoces el color marron": "Si, El marrón es un color que se forma al mezclar rojo, amarillo y azul, y se asocia con la tierra, la estabilidad y la naturaleza.",
    "conoces el color celeste": "Si, El celeste es un tono claro de azul, que se asocia con el cielo despejado y la calma.",
    "conoces el color turquesa": "Si, El turquesa es un color que mezcla azul y verde, y se asocia con la frescura, el agua y la serenidad.",
    "conoces el color plata": "Si, El plata es un color metálico que se asocia con la modernidad, el lujo y la elegancia.",
    "conoces el color oro": "Si, El oro es un color metálico que se asocia con la riqueza, el lujo, la sofisticación y la realeza.",
    "conoces el color verde lima": "Si, El verde lima es un color brillante y fresco que se asocia con la vitalidad, la frescura y la juventud.",
    "conoces el color beige": "Si, El beige es un color neutro, una mezcla de blanco con un toque de marrón, que se asocia con la calma, la elegancia y la sencillez.",
    "que es el rojo": "El rojo es un color primario que se asocia con la pasión, el amor, la energía y el peligro.",
    "que es el azul": "El azul es un color primario que se asocia con la tranquilidad, el cielo, el mar y la serenidad.",
    "que es el verde": "El verde es un color secundario que se forma al mezclar azul y amarillo, y se asocia con la naturaleza, la vida y la calma.",
    "que es el amarillo": "El amarillo es un color primario que se asocia con la alegría, la energía, la luz del sol y la creatividad.",
    "que es el naranja": "El naranja es un color secundario que se forma al mezclar rojo y amarillo, y se asocia con la vitalidad, la diversión y la calidez.",
    "que es el rosa": "El rosa es un color derivado del rojo, y se asocia con el amor, la dulzura, la feminidad y la ternura.",
    "que es el morado": "El morado es un color secundario que se forma al mezclar azul y rojo, y se asocia con la realeza, la espiritualidad y la creatividad.",
    "que es el negro": "El negro es un color que simboliza elegancia, sofisticación, misterio, y también puede asociarse con la oscuridad o la ausencia de color.",
    "que es el blanco": "El blanco es un color que simboliza pureza, limpieza, paz y luz, y es considerado la combinación de todos los colores de la luz visible.",
    "que es el gris": "El gris es un color neutro que se forma al mezclar blanco y negro, y se asocia con la sobriedad, la elegancia y la neutralidad.",
    "que es el marron": "El marrón es un color que se forma al mezclar rojo, amarillo y azul, y se asocia con la tierra, la estabilidad y la naturaleza.",
    "que es el celeste": "El celeste es un tono claro de azul, que se asocia con el cielo despejado y la calma.",
    "que es el turquesa": "El turquesa es un color que mezcla azul y verde, y se asocia con la frescura, el agua y la serenidad.",
    "que es el plata": "El plata es un color metálico que se asocia con la modernidad, el lujo y la elegancia.",
    "que es el oro": "El oro es un color metálico que se asocia con la riqueza, el lujo, la sofisticación y la realeza.",
    "que es el verde lima": "El verde lima es un color brillante y fresco que se asocia con la vitalidad, la frescura y la juventud.",
    "que es el beige": "El beige es un color neutro, una mezcla de blanco con un toque de marrón, que se asocia con la calma, la elegancia y la sencillez.",

    "que es una lavadora": "Una lavadora es un electrodoméstico que se utiliza para lavar ropa de manera automática.",
    "que es un refrigerador": "Un refrigerador es un electrodoméstico que se utiliza para conservar alimentos y bebidas a bajas temperaturas.",
    "que es un microondas": "Un microondas es un electrodoméstico que utiliza radiación para calentar y cocinar alimentos rápidamente.",
    "que es una licuadora": "Una licuadora es un electrodoméstico que se utiliza para mezclar, batir o licuar alimentos y líquidos.",
    "que es un horno": "Un horno es un electrodoméstico utilizado para cocinar o calentar alimentos mediante calor.",
    "que es una aspiradora": "Una aspiradora es un electrodoméstico que se utiliza para limpiar el polvo y la suciedad de los suelos y otras superficies.",

    "que es el clima": "El clima es el conjunto de condiciones atmosféricas que caracterizan una región durante un largo periodo de tiempo.",
    "que es el tiempo": "El tiempo es el estado momentáneo de la atmósfera en un lugar y momento determinado, incluyendo factores como la temperatura, la humedad, la presión, el viento y la precipitación.",
    "que es la temperatura": "La temperatura es la medida del calor o frío de una sustancia o el aire, generalmente medida en grados Celsius o Fahrenheit.",
    "que es la humedad": "La humedad es la cantidad de vapor de agua presente en el aire. Se expresa en porcentaje.",
    "que es la precipitación": "La precipitación es el agua que cae del cielo en forma de lluvia, nieve, granizo o llovizna.",
    "que es el viento": "El viento es el movimiento del aire producido por las diferencias de presión en la atmósfera.",
    "que es la presión atmosférica": "La presión atmosférica es el peso del aire sobre la superficie de la Tierra, que varía dependiendo de la altitud y el clima.",
    "que es una tormenta": "Una tormenta es un fenómeno meteorológico caracterizado por la presencia de lluvias intensas, vientos fuertes, rayos y truenos.",
    "que es un huracan": "Un huracán es una tormenta tropical muy intensa con vientos que superan los 119 km/h y que se forma en los océanos cálidos.",
    "que es un tornado": "Un tornado es un vórtice de aire violento que se forma en las tormentas, con vientos muy fuertes y que puede causar destrucción en su paso.",
    "que es el cambio climatico": "El cambio climático se refiere a los cambios significativos en las condiciones climáticas globales o regionales a lo largo del tiempo, a menudo causado por actividades humanas como la quema de combustibles fósiles.",

    "que es una montaña": "Una montaña es una elevación natural del terreno, generalmente con una cima prominente, que se forma por movimientos tectónicos o actividad volcánica.",
    "que es una llanura": "Una llanura es una extensión de terreno plano o ligeramente ondulado, que generalmente se encuentra a baja altitud.",
    "que es un desierto": "Un desierto es un terreno árido y seco, con escasas precipitaciones y una vegetación muy limitada.",
    "que es un bosque": "Un bosque es una gran extensión de terreno cubierta principalmente por árboles y vegetación.",
    "que es una selva": "Una selva es un tipo de bosque tropical, cálido y húmedo, con una vegetación densa y una gran biodiversidad.",
    "que es una isla": "Una isla es una porción de tierra rodeada de agua por todos sus lados.",
    "que es un valle": "Un valle es una depresión o área baja entre montañas o colinas, generalmente atravesada por un río.",
    "que es un glaciar": "Un glaciar es una masa de hielo que se forma por la acumulación de nieve y se mueve lentamente sobre el terreno.",
    "que es un lago": "Un lago es una masa de agua dulce o salada que se encuentra rodeada por tierra.",
    "que es un rio": "Un río es un cuerpo de agua que fluye constantemente, generalmente desde una fuente o un manantial hasta un mar, océano o lago.",
    "que es una playa": "Una playa es una franja de arena o piedras junto al mar o a un río, donde las olas golpean la orilla.",

    "que es un pais": "Un país es una entidad política y geográfica que tiene fronteras definidas y un gobierno soberano.",
    "cuales son los paises mas grandes del mundo": "Los países más grandes del mundo en superficie son Rusia, Canadá, Estados Unidos, China y Brasil.",
    "cuales son los paises mas poblados": "Los países más poblados son China, India, Estados Unidos, Indonesia y Pakistán.",
    "que es un continente": "Un continente es una gran extensión de tierra que forma parte de la superficie terrestre, como África, América, Asia, Europa, Oceanía y la Antártida.",
    "cual es el pais mas pequeño del mundo": "El país más pequeño del mundo es la Ciudad del Vaticano, con solo 44 hectáreas de superficie.",
    "cual es el pais con mayor economia": "El país con la mayor economía del mundo es Estados Unidos, basado en su producto interno bruto (PIB).",
    "cual es el pais con mayor calidad de vida": "El país con mayor calidad de vida suele ser Suiza, conocido por su bienestar social, sistemas de salud y educación avanzados.",
    "que es un pais desarrollado": "Un país desarrollado es aquel que tiene una economía avanzada, una infraestructura sólida y altos niveles de vida.",
    "que es un pais en vias de desarrollo": "Un país en vías de desarrollo es aquel que está en proceso de mejorar su infraestructura, economía y estándares de vida, pero aún enfrenta desafíos significativos.",
    "cual es el pais con mas idiomas": "India es el país con más idiomas hablados, con más de 450 lenguas diferentes.",
    "cuales son los paises de america": "Los países de América incluyen Estados Unidos, Canadá, México, Brasil, Argentina, Colombia, Venezuela, Perú, Chile, Cuba, Ecuador, Bolivia, Guatemala, Haití, entre otros.",

    "quien es lionel messi": "Lionel Messi es un futbolista argentino, considerado uno de los mejores jugadores de fútbol de todos los tiempos, conocido por su habilidad, visión de juego y capacidad para marcar goles.",
    "quien es cristiano ronaldo": "Cristiano Ronaldo es un futbolista portugués, considerado uno de los mejores jugadores de fútbol de la historia, conocido por su atletismo, habilidades en el campo y récords goleadores.",
    "quien es cr7": "CR7 o Cristiano Ronaldo es un futbolista portugués, considerado uno de los mejores jugadores de fútbol de la historia, conocido por su atletismo, habilidades en el campo y récords goleadores.",
    "quien es michael jordan": "Michael Jordan es un exjugador de baloncesto estadounidense, considerado uno de los mejores jugadores de baloncesto de todos los tiempos, conocido por su carrera en la NBA con los Chicago Bulls.",
    "quien es serena williams": "Serena Williams es una tenista estadounidense, considerada una de las mejores jugadoras de tenis de la historia, conocida por sus victorias en múltiples torneos de Grand Slam.",
    "quien es usain bolt": "Usain Bolt es un exatleta jamaicano, considerado el hombre más rápido del mundo, conocido por sus récords mundiales en los 100 y 200 metros.",
    "quien es pele": "Pelé es un exfutbolista brasileño, considerado uno de los mejores jugadores de fútbol de la historia, famoso por su habilidad para anotar goles y su impacto en la Copa del Mundo.",
    "quien es michael phelps": "Michael Phelps es un nadador estadounidense, considerado el atleta olímpico más exitoso de todos los tiempos, con un total de 23 medallas de oro en los Juegos Olímpicos.",

    "quien es gilda salomone": "Gilda Salomone es una periodista y escritora argentina conocida por su trabajo en el campo de la comunicación y su enfoque en temas de género y derechos humanos.",
    "quien es martha rizzo": "Martha Rizzo es una periodista mexicana, conocida por su trabajo de investigación y su labor en medios de comunicación importantes.",
    "quien es luis carlos de la vega": "Luis Carlos de la Vega es un periodista mexicano conocido por su labor como corresponsal internacional y por su cobertura de noticias de interés global.",
    "quien es anderson cooper": "Anderson Cooper es un periodista y presentador de noticias estadounidense, conocido por su trabajo en CNN y por su cobertura de eventos internacionales de gran importancia.",
    "quien es carlos lopez": "Carlos López es un periodista español conocido por su cobertura en el campo de la política y por su contribución al periodismo de investigación.",
    
    "quien fue alejandro magno": "Alejandro Magno fue un rey de Macedonia y uno de los conquistadores más exitosos de la historia, conocido por crear uno de los imperios más grandes del mundo antiguo.",
    "quien fue napoleon bonaparte": "Napoleón Bonaparte fue un líder militar y emperador francés, conocido por sus reformas y por su ambición de expandir el imperio francés por Europa.",
    "quien fue karl marx": "Karl Marx fue un filósofo, economista y revolucionario alemán, conocido por desarrollar las bases del comunismo y por su obra 'El Capital'.",
    "quien fue cristobal colon": "Cristóbal Colón fue un navegante y explorador genovés, famoso por realizar el primer viaje transatlántico documentado desde Europa y llegar a América.",
    "quien fue gandhi": "Mahatma Gandhi fue un líder político y espiritual indio, conocido por su lucha por la independencia de la India mediante la resistencia no violenta.",
    "quien fue juan pablo ii": "Juan Pablo II fue el papa de la Iglesia Católica entre 1978 y 2005, conocido por su labor para mejorar las relaciones interreligiosas y por su influencia mundial.",
    "quien fue elizabeth i de inglaterra": "Isabel I fue la reina de Inglaterra e Irlanda entre 1558 y 1603, conocida por su liderazgo durante la Edad de Oro inglesa y la victoria sobre la Armada Invencible.",
    "quien fue simon bolivar": "Simón Bolívar fue un líder militar y político venezolano, conocido por ser el principal impulsor de la independencia de varios países sudamericanos del Imperio español.",

    "quien es albert einstein": "Albert Einstein fue un físico teórico alemán, conocido por desarrollar la teoría de la relatividad, una de las dos principales teorías de la física moderna.",
    "quien es marilyn monroe": "Marilyn Monroe fue una famosa actriz, cantante y modelo estadounidense, considerada un ícono de la cultura pop y un símbolo de belleza y sensualidad.",
    "quien es william shakespeare": "William Shakespeare fue un escritor, poeta y dramaturgo inglés, ampliamente considerado como uno de los más grandes escritores de la lengua inglesa.",
    "quien es martin luther king jr": "Martin Luther King Jr. fue un activista estadounidense, líder del movimiento por los derechos civiles en EE.UU., famoso por su discurso 'I Have a Dream'.",
    "quien es pablo picasso": "Pablo Picasso fue un pintor y escultor español, conocido por cofundar el cubismo y por su enorme influencia en el arte moderno.",
    "quien es leonardo da vinci": "Leonardo da Vinci fue un pintor, ingeniero, inventor y científico italiano del Renacimiento, famoso por obras como 'La Mona Lisa' y 'La Última Cena'.",
    "quien es audrey hepburn": "Audrey Hepburn fue una actriz y humanitaria británica, conocida por su elegancia y sus papeles en películas clásicas como 'Desayuno en Tiffany's'.",
    "quien es winston churchill": "Winston Churchill fue un estadista y líder británico, conocido por ser el primer ministro del Reino Unido durante la Segunda Guerra Mundial y su firme liderazgo durante la guerra.",
    "quien es frida kahlo": "Frida Kahlo fue una pintora mexicana, conocida por sus autorretratos y por su capacidad para transmitir su dolor físico y emocional a través de su arte.",

    "conoces la pelicula el titanic": "Titanic es una película dirigida por James Cameron, estrenada en 1997, que narra la historia de amor entre Jack y Rose a bordo del famoso transatlántico que se hundió en 1912.",
    "conoces la pelicula el padrino": "El Padrino es una película dirigida por Francis Ford Coppola, estrenada en 1972, que cuenta la historia de la familia Corleone, una de las más poderosas en el mundo de la mafia italoamericana.",
    "conoces la pelicula avengers: endgame": "Avengers: Endgame es una película de superhéroes dirigida por Anthony y Joe Russo, estrenada en 2019, que culmina la saga de los Avengers en el universo cinematográfico de Marvel.",
    "conoces la pelicula la guerra de las galaxias": "La Guerra de las Galaxias es una franquicia cinematográfica creada por George Lucas, que narra las aventuras en un universo ficticio lleno de jedis, siths, y luchas por la galaxia.",
    "conoces la pelicula forrest gump": "Forrest Gump es una película dirigida por Robert Zemeckis, estrenada en 1994, que sigue la vida de un hombre con un bajo coeficiente intelectual, pero con un corazón bondadoso y una vida llena de eventos históricos.",
    "conoces la pelicula el rey leon": "El Rey León es una película animada de Disney, estrenada en 1994, que narra la historia de Simba, un león que lucha por reclamar su lugar como rey de la sabana africana.",
    "conoces la pelicula matrix": "Matrix es una película de ciencia ficción dirigida por las hermanas Wachowski, estrenada en 1999, que explora una realidad virtual en la que los humanos están controlados por máquinas.",
    "conoces la pelicula la lista de schindler": "La lista de Schindler es una película dirigida por Steven Spielberg, estrenada en 1993, que cuenta la historia de un empresario alemán que salvó a más de mil judíos del Holocausto durante la Segunda Guerra Mundial.",
    "conoces la pelicula el origen": "El Origen (Inception) es una película dirigida por Christopher Nolan, estrenada en 2010, que se centra en la manipulación de los sueños y la distorsión de la realidad.",
    "conoces la pelicula jurassic park": "Jurassic Park es una película dirigida por Steven Spielberg, estrenada en 1993, que se desarrolla en un parque de dinosaurios clonados que se descontrola, causando caos y terror.",

    "que es google": "Google es un motor de búsqueda en internet creado en 1998, que permite a los usuarios buscar información en la web y proporciona diversos servicios como Gmail, Google Maps y YouTube.",
    "que es wikipedia": "Wikipedia es una enciclopedia libre y colaborativa en línea, creada en 2001, donde los usuarios pueden editar y agregar artículos sobre diversos temas.",
    "que es facebook": "Facebook es una red social creada en 2004 por Mark Zuckerberg, que permite a los usuarios conectarse, compartir contenido, y comunicarse con amigos y familiares.",
    "que es amazon": "Amazon es una plataforma de comercio electrónico fundada en 1994 por Jeff Bezos, que permite a los usuarios comprar productos de todo tipo a través de internet.",
    "que es twitter": "Twitter es una red social fundada en 2006 que permite a los usuarios enviar mensajes cortos llamados tuits, interactuar con otros usuarios y seguir temas de interés.",
    "que es instagram": "Instagram es una red social de fotos y videos fundada en 2010, adquirida por Facebook en 2012, que permite a los usuarios compartir imágenes y videos con sus seguidores.",
    "que es youtube": "YouTube es una plataforma de videos en línea fundada en 2005, donde los usuarios pueden subir, ver y compartir videos de todo tipo, desde tutoriales hasta contenido de entretenimiento.",
    "que es netflix": "Netflix es un servicio de streaming de video que ofrece series, películas y documentales en línea, creado en 1997, y que ha transformado la industria del entretenimiento digital.",

    "que es un numero primo": "Un número primo es un número mayor que 1 que solo tiene dos divisores positivos: 1 y él mismo. Ejemplo: 2, 3, 5, 7, 11.",
    "que es un numero compuesto": "Un número compuesto es un número mayor que 1 que tiene más de dos divisores positivos. Ejemplo: 4, 6, 8, 9.",
    "que es el cero": "El cero es un número que representa la ausencia de cantidad y se usa como punto de referencia en el sistema numérico decimal.",
    "que es un numero entero": "Un número entero es un número que no tiene parte decimal o fraccionaria, y puede ser positivo, negativo o cero. Ejemplo: -3, 0, 4.",
    "que es un numero decimal": "Un número decimal es un número que tiene una parte fraccionaria separada por un punto o coma, como 3.14 o 0.75.",
    "que es el infinito": "El infinito es un concepto matemático que describe algo sin límite o fin, y se representa con el símbolo ∞.",
    "que es un numero racional": "Un número racional es un número que puede expresarse como el cociente de dos enteros, es decir, como una fracción. Ejemplo: 1/2, 3/4.",
    "que es un numero irracional": "Un número irracional es un número que no puede expresarse como el cociente de dos enteros, y tiene una expansión decimal infinita no periódica. Ejemplo: √2, π.",

    "area de un circulo": "El área de un círculo se calcula con la fórmula A = πr², donde r es el radio del círculo.",
    "perimetro de un rectangulo": "El perímetro de un rectángulo se calcula con la fórmula P = 2(l + w), donde l es la longitud y w es el ancho.",
    "volumen de un cubo": "El volumen de un cubo se calcula con la fórmula V = a³, donde a es la longitud de un lado del cubo.",
    "teorema de pitagoras": "El teorema de Pitágoras establece que en un triángulo rectángulo, la suma de los cuadrados de los catetos es igual al cuadrado de la hipotenusa: a² + b² = c².",
    "ecuacion cuadratica": "La ecuación cuadrática se resuelve con la fórmula: x = (-b ± √(b² - 4ac)) / 2a, donde a, b y c son los coeficientes de la ecuación ax² + bx + c = 0.",
    "area de un triangulo": "El área de un triángulo se calcula con la fórmula A = (b × h) / 2, donde b es la base y h es la altura del triángulo.",
    "formula de la pendiente": "La fórmula de la pendiente de una recta en el plano cartesiano es m = (y₂ - y₁) / (x₂ - x₁), donde (x₁, y₁) y (x₂, y₂) son dos puntos en la recta.",
    "volumen de una esfera": "El volumen de una esfera se calcula con la fórmula V = (4/3)πr³, donde r es el radio de la esfera.",
    "perimetro de un circulo": "El perímetro de un círculo se calcula con la fórmula P = 2πr, donde r es el radio del círculo.",

    "que es la tarjeta madre": "La tarjeta madre, también conocida como placa base, es el componente principal de una computadora, donde se conectan y comunican todos los demás componentes como el procesador, la memoria RAM y las tarjetas de expansión.",
    "que es la tarjeta grafica": "La tarjeta gráfica, o GPU, es un componente encargado de procesar y generar las imágenes que se visualizan en la pantalla de la computadora. Es esencial para juegos y trabajos de diseño gráfico y edición de video.",
    "que es el procesador": "El procesador, o CPU, es el cerebro de la computadora. Realiza los cálculos y las instrucciones necesarias para ejecutar los programas y operaciones del sistema.",
    "que es la memoria RAM": "La memoria RAM (Random Access Memory) es la memoria volátil de la computadora que almacena temporalmente los datos y programas que están en uso activo, permitiendo un acceso rápido.",
    "que es el disco duro": "El disco duro, también conocido como HDD, es un dispositivo de almacenamiento que guarda de manera permanente los datos y archivos del sistema operativo y otros programas. Puede ser mecánico o de estado sólido (SSD).",
    "que es una fuente de alimentacion": "La fuente de alimentación es el componente que suministra energía eléctrica a todos los componentes de la computadora, convirtiendo la corriente alterna de la red en corriente continua.",
    "que es una unidad de estado solido (SSD)": "Un SSD (Solid State Drive) es un dispositivo de almacenamiento que usa memoria flash para guardar los datos, ofreciendo una mayor velocidad y durabilidad en comparación con los discos duros tradicionales (HDD).",
    "que es el disipador de calor": "El disipador de calor es un componente que ayuda a reducir la temperatura del procesador y otros componentes de la computadora, mediante la transferencia de calor hacia el aire o un líquido refrigerante.",
    "que es la tarjeta de sonido": "La tarjeta de sonido es un componente que permite la entrada y salida de audio en una computadora, proporcionando una mejor calidad de sonido que la integrada en la placa base.",
    "que es una tarjeta de red": "Una tarjeta de red es un componente que permite la conexión de la computadora a una red de comunicaciones, como Internet o una red local (LAN).",

    "que es microsoft word": "Microsoft Word es un procesador de texto ampliamente utilizado que forma parte del paquete de Microsoft Office. Permite crear, editar, y guardar documentos de texto con múltiples funciones de formato.",
    "que es adobe photoshop": "Adobe Photoshop es un software de edición gráfica y diseño utilizado para crear y modificar imágenes digitales, conocido por su amplia gama de herramientas de manipulación de fotos.",
    "que es google chrome": "Google Chrome es un navegador web desarrollado por Google, conocido por su velocidad, facilidad de uso, y gran compatibilidad con las extensiones.",
    "que es microsoft excel": "Microsoft Excel es un programa de hojas de cálculo que permite la organización, análisis y visualización de datos en forma de tablas, gráficos y fórmulas.",
    "que es adobe illustrator": "Adobe Illustrator es un software de diseño gráfico vectorial utilizado para crear ilustraciones, logotipos, tipografías y gráficos digitales.",
    "que es autocad": "AutoCAD es un software de diseño asistido por computadora (CAD) utilizado en arquitectura, ingeniería y diseño para crear planos, modelos y dibujos técnicos en 2D y 3D.",
    "que es skype": "Skype es un programa de comunicación que permite realizar llamadas de voz y videollamadas a través de Internet, además de enviar mensajes de texto y compartir archivos.",
    "que es vlc media player": "VLC Media Player es un reproductor multimedia gratuito y de código abierto que soporta una amplia gama de formatos de audio y video, conocido por su compatibilidad con casi todos los tipos de archivo.",
    "que es zoom": "Zoom es una plataforma de videoconferencias que permite realizar reuniones en línea, compartir pantallas, grabar sesiones y colaborar de manera remota.",
    "que es adobe premiere pro": "Adobe Premiere Pro es un software de edición de video profesional utilizado para cortar, montar y producir videos de alta calidad, ampliamente usado en la industria del cine y la televisión.",

    "quien es pewdiepie": "PewDiePie, cuyo nombre real es Felix Kjellberg, es un creador de contenido sueco conocido por sus videos de Let's Plays, reacciones y comentarios sobre videojuegos y cultura pop. Fue el youtuber con más suscriptores hasta 2019.",
    "quien es mrbeast": "MrBeast, cuyo nombre real es Jimmy Donaldson, es un youtuber estadounidense conocido por sus videos virales que incluyen desafíos extremos, donaciones masivas y actos de caridad.",
    "quien es charli d'amelio": "Charli D'Amelio es una influencer y creadora de contenido estadounidense, famosa por sus videos de baile en TikTok y por su popularidad en las redes sociales.",
    "quien es emma chamberlain": "Emma Chamberlain es una youtuber y creadora de contenido conocida por su estilo único y humor espontáneo, que ha ganado una enorme base de seguidores en YouTube y otras plataformas.",
    "quien es james charles": "James Charles es un influencer y youtuber estadounidense conocido por sus tutoriales de maquillaje, colaboraciones con celebridades y por ser el primer embajador de belleza masculino de CoverGirl.",
    "quien es logan paul": "Logan Paul es un youtuber y creador de contenido estadounidense conocido por sus vlogs, desafíos y su controversia mediática. Ha ampliado su carrera al boxeo profesional.",
    "quien es ninja": "Ninja, cuyo nombre real es Tyler Blevins, es un famoso streamer y youtuber especializado en videojuegos, especialmente conocido por sus transmisiones en vivo de Fortnite.",
    "quien es david dobrik": "David Dobrik es un creador de contenido y youtuber conocido por sus vlogs llenos de bromas y desafíos, además de ser parte del grupo de creadores llamado 'Vlog Squad'.",
    "quien es lilly singh": "Lilly Singh es una youtuber, actriz y comediante canadiense, conocida por sus videos de comedia y por su talk show en la televisión, 'A Little Late with Lilly Singh'.",
    "quien es jacksepticeye": "Jacksepticeye, cuyo nombre real es Seán McLoughlin, es un youtuber irlandés conocido por sus videos de Let's Plays, vlogs y comentarios de videojuegos, además de su personalidad enérgica y carismática.",
    "quien es ibai": "Ibai Llanos es un streamer y creador de contenido español, conocido por sus transmisiones en vivo de videojuegos, entrevistas y su carisma. Anteriormente trabajó en la industria del deporte y en el canal deportivo de Twitch.",
    "quien es auronplay": "AuronPlay, cuyo nombre real es Raúl Álvarez Genes, es un youtuber y streamer español, conocido por sus bromas, sátiras y contenido humorístico. Es uno de los creadores de contenido más populares de habla hispana.",
    "quien es el rubius": "El Rubius, cuyo nombre real es Rubén Doblas, es un youtuber español que se hizo famoso por sus videos de videojuegos, vlogs y humor. Ha sido uno de los creadores de contenido más influyentes en la comunidad hispanohablante.",
    "quien es thegrefg": "TheGrefg, cuyo nombre real es David Cánovas, es un streamer y creador de contenido español, conocido por sus transmisiones de videojuegos, especialmente Fortnite, y por sus participaciones en eventos internacionales como la creación de su propio skin en Fortnite.",
    "quien es vegetta777": "Vegetta777, cuyo nombre real es Samuel de Luque, es un youtuber y creador de contenido español, conocido por sus videos de videojuegos como Minecraft, Grand Theft Auto y Fortnite, y por su estilo de narración único.",
    "quien es willyrex": "Willyrex, cuyo nombre real es Guillermo Díaz, es un youtuber y creador de contenido español, famoso por sus videos de videojuegos y por ser uno de los grandes referentes de la comunidad de gamers en español.",
    "quien es dross": "Dross, cuyo nombre real es Ángel David Revilla, es un youtuber y escritor venezolano, conocido por sus videos de terror, misterio, y su estilo de narración irónica y sarcástica.",
    "quien es rubiusomg": "RubiusOMG es el canal de El Rubius, uno de los youtubers más populares, donde sube sus videos de videojuegos, retos, y contenido variado con un enfoque humorístico y entretenido.",
    "quien es markiplier": "markiplier, cuyo nombre real es mark fischbach, es un youtuber estadounidense famoso por sus videos de videojuegos, especialmente de terror, y sus colaboraciones con otros creadores de contenido. es conocido por su energía y estilo cómico.",
    "quien es jake paul": "jake paul es un youtuber y creador de contenido estadounidense, conocido por sus vlogs, bromas y retos. ha generado controversias a lo largo de su carrera y también ha incursionado en el boxeo.",
    "quien es ksi": "ksi, cuyo nombre real es olajide olayinka williams 'jj' olatunji, es un youtuber británico famoso por sus videos de videojuegos, vlogs y su carrera en la música y el boxeo. también ha estado involucrado en varias controversias.",
    "quien es zoella": "zoella, cuyo nombre real es zoe sugg, es una youtuber británica conocida por sus videos de belleza, moda y estilo de vida. ha publicado varios libros y se ha convertido en un referente dentro del mundo de la belleza y el bienestar.",
    "quien es shane dawson": "shane dawson es un youtuber estadounidense conocido por sus documentales de investigación, sus videos de comedia y sus controversias. ha sido uno de los pioneros en youtube en crear contenido documental sobre otros influencers.",
    "quien es t-series": "t-series es un canal de youtube indio que ha alcanzado el mayor número de suscriptores en la plataforma. se especializa en la publicación de videos de música y trailers de películas en hindi, y es operado por la empresa de entretenimiento t-series.",
    "quien es dream": "dream es un youtuber estadounidense famoso por sus videos de 'minecraft', especialmente por sus 'speedruns' y sus colaboraciones en su serie de 'minecraft manhunt'. su identidad real sigue siendo un misterio, lo que ha generado mucha especulación entre sus seguidores.",
    "quien es corpse husband": "corpse husband es un youtuber y streamer estadounidense conocido por su voz grave y misteriosa, así como por sus videos de narración de historias de terror y sus transmisiones de videojuegos. ha ganado popularidad por su personalidad y su estilo único.",
    "quien es theodd1sout": "theodd1sout, cuyo nombre real es james ralls, es un youtuber estadounidense conocido por sus animaciones y videos de comedia. su estilo de animación y su humor autocrítico lo han convertido en uno de los creadores más queridos de la comunidad.",
    "quien es unbox therapy": "unbox therapy, dirigido por lewis hilsenteger, es un canal de tecnología de youtube donde se hacen unboxings (desembalaje) de productos de tecnología. es conocido por sus análisis detallados y su enfoque en los gadgets y dispositivos más novedosos.",
    "quien es alisha marie": "alisha marie es una youtuber estadounidense conocida por sus videos de estilo de vida, belleza, y retos. también ha hecho vlogs y colaboraciones con otras creadoras de contenido. su canal está lleno de entretenimiento y consejos para su audiencia joven.",
    "quien es fgteev": "fgteev es un canal familiar de youtube, que incluye a los miembros de la familia funkin' gaming. es conocido por sus videos de juegos, en especial de 'roblox' y 'minecraft', así como por sus bromas y desafíos familiares.",
    "quien es vanossgaming": "vanossgaming es un canal de youtube dirigido por evan fong, un canadiense conocido por sus videos de comedia en videojuegos, principalmente en juegos como 'gta v' y 'garry's mod'. su contenido es muy apreciado por su humor y sus colaboraciones con otros youtubers populares.",
    "quien es ray william johnson": "ray william johnson fue uno de los youtubers más populares en sus primeros años, conocido por su canal 'equals three', donde comentaba viral videos de internet. aunque ha dejado de crear contenido frecuentemente, su legado en youtube sigue siendo muy influyente.",
    "quien es elrubius": "elrubius, cuyo nombre real es rubén dorantes, es un youtuber español famoso por sus videos de videojuegos, retos y vlogs. es uno de los creadores de contenido más seguidos en youtube en español, y su estilo de humor irreverente lo ha convertido en un referente en la comunidad de habla hispana.",
    "quien es ipi": "ipi es una youtuber española famosa por sus tutoriales de belleza, moda y estilo de vida. ha ganado mucha popularidad por su enfoque auténtico y relajado en sus videos, que abarcan desde rutinas de cuidado personal hasta consejos de moda.",
    "quien es kimberly loaiza": "kimberly loaiza es una youtuber y cantante mexicana, conocida por sus videos de estilo de vida, vlogs y desafíos. también ha tenido éxito en la música y en redes sociales, siendo una de las influencer más relevantes de habla hispana. aunque actualmente no sube videos, en su momento fue muy querida por sus fans y seguidores.",
    "quien es yuya": "yuya, cuyo nombre real es maría jose carrera, es una youtuber mexicana famosa por sus tutoriales de belleza, maquillaje y moda. su canal ha sido uno de los más seguidos en youtube en español y ha lanzado su propia línea de productos de belleza.",
    "quien es la divaza": "la divaza, cuyo nombre real es pedro, es un youtuber venezolano conocido por su estilo humorístico y sus videos de moda, entretenimiento y cultura pop. su personalidad extravagante y su enfoque en temas de actualidad lo han convertido en una de las figuras más populares del mundo digital.",
    "quien es soy una pringada": "soy una pringada, cuyo nombre real es rebe, es una youtuber española conocida por su humor ácido y su estilo único. se especializa en temas de crítica social, moda, estilo de vida y entretenimiento, y su canal se caracteriza por su actitud irreverente.",
    "quien es mariandcastilla": "mariandcastilla, conocida como 'mariand castilla', es una youtuber mexicana que crea contenido sobre belleza, maquillaje y estilo de vida. ha ganado popularidad por sus tutoriales y su enfoque amigable y cercano con su audiencia.",
    "quien es lospolines": "lospolines es un canal de youtube dirigido por el influencer mexicano 'polinesio', que es conocido por sus videos de retos, bromas y aventuras familiares. su estilo de contenido diverso ha ganado una gran cantidad de seguidores jóvenes.",
    "quien es juanpa zurita": "juanpa zurita es un youtuber y actor mexicano conocido por sus vlogs de comedia y por su presencia en redes sociales. ha trabajado en la televisión y en proyectos internacionales, consolidándose como uno de los influencers más importantes de habla hispana.",
    "quien es thomasito": "thomasito es un youtuber español que se hizo famoso por sus videos de comedia, bromas y su estilo espontáneo. sus videos, a menudo centrados en situaciones cotidianas, han ganado muchos seguidores, especialmente entre los más jóvenes.",
    "quien es javi olivares": "javi olivares es un youtuber español conocido por su contenido de crítica y análisis de películas, series y temas de actualidad. sus opiniones y análisis profundos sobre cultura pop lo han convertido en un referente para los amantes del cine y la televisión.",
    "quien es las aventuras de sofía": "las aventuras de sofía es una youtuber española que se especializa en contenido familiar, vlogs y retos. su canal está enfocado en su vida cotidiana y sus experiencias personales, y ha conseguido una gran comunidad de seguidores.",
    "quien es luisito comunica": "luisito comunica, cuyo nombre real es luis arana, es un youtuber mexicano conocido por sus videos de viajes y exploración de culturas alrededor del mundo. su estilo relajado y su interés en mostrar diferentes partes del planeta lo han convertido en un referente entre los creadores de contenido.",
    "quien es el canal de las estrellas": "el canal de las estrellas es el canal de youtube del conglomerado mexicano televisa. en él, se publican entrevistas, vlogs, y contenido exclusivo de los programas más populares de la televisión mexicana.",
    "quien es patry jordan": "patry jordan es una youtuber española conocida por su contenido sobre belleza, moda y estilo de vida. sus tutoriales de maquillaje y consejos de moda han atraído a miles de seguidores interesados en mejorar su imagen personal.",
    "quien es hola soy german": "hola soy germán, cuyo nombre real es germán garmendia, es un youtuber chileno famoso por sus videos de comedia, vlogs y comentarios sobre situaciones cotidianas. su estilo humorístico y su forma de narrar historias lo han convertido en uno de los youtubers más populares de habla hispana.",
    "quien es fernanfloo": "fernanfloo, cuyo nombre real es luis alberto, es un youtuber salvadoreño conocido por sus videos de videojuegos, bromas y contenido humorístico. su personalidad energética y su estilo único lo han convertido en uno de los youtubers más seguidos en la comunidad de habla hispana.",
    "quien es jackie hernandez": "jackie hernandez es una youtuber mexicana conocida por su contenido de estilo de vida, moda, belleza y retos. ha ganado gran popularidad por su carisma y su autenticidad, mostrando a sus seguidores su vida cotidiana y su pasión por la moda.",
    "quien es andrea": "andrea es una youtuber mexicana famosa por sus videos de estilo de vida, moda y belleza. su canal ofrece consejos sobre cómo mejorar el aspecto personal y mantener una vida saludable y equilibrada.",
    "quien es karlita es una chica": "karlita es una youtuber mexicana que se ha destacado en el mundo del maquillaje, belleza y estilo de vida. sus tutoriales de maquillaje y moda la han convertido en una influencer destacada, especialmente entre las adolescentes.",
    "quien es karla bustillos": "Karla Bustillos es una youtuber y creadora de contenido mexicana conocida por sus videos de estilo de vida, belleza, moda y consejos para una vida saludable. A través de su canal de YouTube, Karla ha compartido temas relacionados con su día a día, así como consejos sobre maquillaje, moda, viajes, bienestar y más. Su estilo cercano y auténtico le ha permitido conectar con una gran comunidad de seguidores, especialmente en la audiencia joven, quienes siguen sus recomendaciones y se sienten identificados con su contenido.",

    "quien fue Cleopatra": "Cleopatra fue la última faraona de Egipto y una figura influyente de la historia antigua.",
    "quien fue Galileo Galilei": "Galileo fue un astrónomo, físico e ingeniero italiano, conocido como el padre de la ciencia moderna.",
    "quien fue Nikola Tesla": "Nikola Tesla fue un inventor y científico serbio-estadounidense que contribuyó al desarrollo de la corriente alterna.",
    "quien fue Ada Lovelace": "Ada Lovelace fue una matemática inglesa considerada la primera programadora de la historia.",
    "quien fue Frida Kahlo": "Frida Kahlo fue una pintora mexicana conocida por sus autorretratos y su estilo surrealista.",
    

    "que fue el Renacimiento": "El Renacimiento fue un movimiento cultural europeo que marcó el fin de la Edad Media y el comienzo de la Edad Moderna.",
    "que fue la Guerra Fria": "La Guerra Fría fue un período de tensión política entre Estados Unidos y la Unión Soviética después de la Segunda Guerra Mundial.",
    "que fue la caida del Muro de Berlin": "La caída del Muro de Berlín en 1989 marcó el fin de la Guerra Fría y la reunificación de Alemania.",
    "que fue el Imperio Romano": "El Imperio Romano fue una de las civilizaciones más grandes e influyentes de la historia, que existió entre el 27 a.C. y el 476 d.C.",
    
  
    "quien invento el telefono": "Alexander Graham Bell es conocido por inventar el primer teléfono práctico.",
    "quien invento la electricidad": "La electricidad no fue inventada, pero Benjamin Franklin, Thomas Edison y Nikola Tesla hicieron importantes contribuciones para su uso práctico.",
    "que es blockchain": "Blockchain es una tecnología de registro distribuido que garantiza la seguridad y la transparencia en transacciones digitales.",
    "que es una criptomoneda": "Una criptomoneda es una moneda digital basada en criptografía, utilizada como medio de intercambio descentralizado.",
    

    "que es el surrealismo": "El surrealismo es un movimiento artístico y literario que busca liberar la imaginación de las restricciones racionales.",
    "que es el impresionismo": "El impresionismo es un estilo artístico que captura la luz y el color en escenas de la vida cotidiana.",
    "quien fue Pablo Picasso": "Pablo Picasso fue un pintor y escultor español, cofundador del movimiento cubista.",
    "quien fue Miguel Angel": "Miguel Ángel fue un artista renacentista italiano conocido por sus esculturas y pinturas, como la Capilla Sixtina.",
  
    "que es el ADN": "El ADN es una molécula que contiene la información genética necesaria para el desarrollo y funcionamiento de los seres vivos.",
    "quien descubrio la penicilina": "Alexander Fleming descubrió la penicilina, el primer antibiótico, en 1928.",
    "que es el Big Bang": "El Big Bang es la teoría que explica el origen del universo a partir de una gran explosión hace aproximadamente 13.8 mil millones de años.",
  
    "que es el algoritmo de Euclides": "El algoritmo de Euclides es un método para encontrar el máximo común divisor entre dos números.",
    "que es un fractal": "Un fractal es una figura geométrica que se repite a diferentes escalas y es autosemejante.",
    
    "cual es el rio mas largo del mundo": "El río Amazonas es considerado el más largo del mundo.",
    "cual es la montaña mas alta del mundo": "El Monte Everest, con una altura de 8,848 metros, es la montaña más alta del mundo.",
    "que es una peninsula": "Una península es una extensión de tierra rodeada de agua por tres lados.",
    "que es un oceano": "Un océano es una vasta extensión de agua salada que cubre la mayor parte de la superficie terrestre.",

    "que es la computacion cuantica": "La computación cuántica utiliza principios de la mecánica cuántica para procesar información de manera más eficiente que las computadoras clásicas.",
    "que es un drone": "Un dron es un vehículo aéreo no tripulado que puede ser controlado de forma remota o autónoma.",
    "que es el metaverso": "El metaverso es un espacio virtual compartido, creado por la convergencia de la realidad física y la virtualidad aumentada.",
    "que es una inteligencia artificial generativa": "Es un tipo de IA que puede crear contenido como texto, imágenes, audio y más, similar a como lo haría un humano."
}
